statistics/slides.tex
% Created 2010-11-11 Thu 01:35
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Statistics}
\author{FOSSEE}
\date{11 November 2010}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle










\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item Doing statistical operations in Python

\begin{itemize}
\item Summing set of numbers
\item Finding there mean
\item Finding there Median
\item Finding there Standard Deviation
\end{itemize}

\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Data set}
\label{sec-2}

\begin{itemize}
\item A;015163;JOSEPH RAJ S;083;042;47;00;72;244;;;
\end{itemize}


  The following are the fields in any given line.
\begin{itemize}
\item Region Code which is `A'
\item Roll Number 015163
\item Name JOSEPH RAJ S
\item Marks of 5 subjects: -- English 083 -- 
     Hindi 042 -- Maths 47 --
     Science 35 -- Social 72
\item Total marks 244
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question}
\label{sec-3}

\begin{itemize}
\item In the given file football.txt at path /home/fossee/football.txt , 
    one column is player name,second is goals at home 
    and third goals away.

\begin{itemize}
\item Find the total goals for each player
\item Mean home and away goals
\item Standard deviation of home and away goals
\end{itemize}

\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution}
\label{sec-4}

\begin{verbatim}
L=loadtxt('/home/amit/football.txt',usecols=(1,2),
          delimiter=',')
sum(L,1)
mean(L,0)
std(L,0)
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Summary}
\label{sec-5}

\begin{itemize}
\item sum
\item mean
\item median
\item std
\end{itemize}
\end{frame}

\end{document}
